---
kind: property
id: P:Autodesk.Revit.DB.View.GenLevel
zh: 视图
source: html/95f430ac-65e5-87b1-aea9-937412ef2eb8.htm
---
# Autodesk.Revit.DB.View.GenLevel Property

**中文**: 视图

The level for the view.

## Syntax (C#)
```csharp
public Level GenLevel { get; }
```

## Remarks
This will obtain the level for views related to levels, such as Plan Views.
If this View is not generated by a level, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .